###################################################################

# Created by write_sdc on Thu Nov 28 20:15:40 2024

###################################################################
set sdc_version 2.0

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_max_transition 0.6 [current_design]
set_max_fanout 32 [current_design]
set_max_area 0
set_load -pin_load 10 [get_ports ovalid]
set_load -pin_load 10 [get_ports {dout[15]}]
set_load -pin_load 10 [get_ports {dout[14]}]
set_load -pin_load 10 [get_ports {dout[13]}]
set_load -pin_load 10 [get_ports {dout[12]}]
set_load -pin_load 10 [get_ports {dout[11]}]
set_load -pin_load 10 [get_ports {dout[10]}]
set_load -pin_load 10 [get_ports {dout[9]}]
set_load -pin_load 10 [get_ports {dout[8]}]
set_load -pin_load 10 [get_ports {dout[7]}]
set_load -pin_load 10 [get_ports {dout[6]}]
set_load -pin_load 10 [get_ports {dout[5]}]
set_load -pin_load 10 [get_ports {dout[4]}]
set_load -pin_load 10 [get_ports {dout[3]}]
set_load -pin_load 10 [get_ports {dout[2]}]
set_load -pin_load 10 [get_ports {dout[1]}]
set_load -pin_load 10 [get_ports {dout[0]}]
set_ideal_network -no_propagate  [get_ports clk]
set_ideal_network -no_propagate  [get_ports weight]
set_ideal_network -no_propagate  [get_pins weight_addr_reg_7_/Q]
create_clock -name clk  -period 5  -waveform {0 2.5}
set_clock_uncertainty -setup 0.4  [get_clocks clk]
set_clock_uncertainty -hold 0.2  [get_clocks clk]
set_clock_gating_check -rise -setup 0.4 [get_clocks clk]
set_clock_gating_check -fall -setup 0.4 [get_clocks clk]
set_clock_gating_check -rise -hold 0.2 [get_clocks clk]
set_clock_gating_check -fall -hold 0.2 [get_clocks clk]
group_path -weight 5  -name reg2reg  -from [list [get_pins osign_reg/CK] [get_pins dout_r_reg_1_/CK] [get_pins dout_r_reg_2_/CK] [get_pins dout_r_reg_3_/CK] [get_pins dout_r_reg_4_/CK] [get_pins dout_r_reg_5_/CK] [get_pins dout_r_reg_6_/CK] [get_pins dout_r_reg_7_/CK] [get_pins dout_r_reg_8_/CK] [get_pins dout_r_reg_9_/CK] [get_pins dout_r_reg_10_/CK] [get_pins dout_r_reg_11_/CK] [get_pins dout_r_reg_12_/CK] [get_pins dout_r_reg_13_/CK] [get_pins dout_r_reg_14_/CK] [get_pins dout_r_reg_15_/CK] [get_pins sum_reg_1_/CK] [get_pins sum_reg_2_/CK] [get_pins sum_reg_3_/CK] [get_pins sum_reg_4_/CK] [get_pins sum_reg_5_/CK] [get_pins sum_reg_6_/CK] [get_pins sum_reg_7_/CK] [get_pins sum_reg_8_/CK] [get_pins sum21_reg_1_/CK] [get_pins sum21_reg_2_/CK] [get_pins sum21_reg_3_/CK] [get_pins sum21_reg_4_/CK] [get_pins sum21_reg_5_/CK] [get_pins sum21_reg_6_/CK] [get_pins sum21_reg_7_/CK] [get_pins sum20_reg_1_/CK] [get_pins sum20_reg_2_/CK] [get_pins sum20_reg_3_/CK] [get_pins sum20_reg_4_/CK] [get_pins sum20_reg_5_/CK] [get_pins sum20_reg_6_/CK] [get_pins sum20_reg_7_/CK] [get_pins sum10_reg_1_/CK] [get_pins sum10_reg_2_/CK] [get_pins sum10_reg_3_/CK] [get_pins sum10_reg_4_/CK] [get_pins sum10_reg_5_/CK] [get_pins sum10_reg_6_/CK] [get_pins sum12_reg_1_/CK] [get_pins sum12_reg_2_/CK] [get_pins sum12_reg_3_/CK] [get_pins sum12_reg_4_/CK] [get_pins sum12_reg_5_/CK] [get_pins sum12_reg_6_/CK] [get_pins sum11_reg_1_/CK] [get_pins sum11_reg_2_/CK] [get_pins sum11_reg_3_/CK] [get_pins sum11_reg_4_/CK] [get_pins sum11_reg_5_/CK] [get_pins sum11_reg_6_/CK] [get_pins sum00_reg_1_/CK] [get_pins sum00_reg_2_/CK] [get_pins sum00_reg_3_/CK] [get_pins sum00_reg_4_/CK] [get_pins sum05_reg_1_/CK] [get_pins sum05_reg_2_/CK] [get_pins sum05_reg_3_/CK] [get_pins sum05_reg_4_/CK] [get_pins sum02_reg_1_/CK] [get_pins sum02_reg_2_/CK] [get_pins sum02_reg_3_/CK] [get_pins sum02_reg_4_/CK] [get_pins sum01_reg_1_/CK] [get_pins sum01_reg_2_/CK] [get_pins sum01_reg_3_/CK] [get_pins sum01_reg_4_/CK] [get_pins sum04_reg_1_/CK] [get_pins sum04_reg_2_/CK] [get_pins sum04_reg_3_/CK] [get_pins sum04_reg_4_/CK] [get_pins sum03_reg_1_/CK] [get_pins sum03_reg_2_/CK] [get_pins sum03_reg_3_/CK] [get_pins sum03_reg_4_/CK] [get_pins p9_reg/CK] [get_pins p10_reg/CK] [get_pins p11_reg/CK] [get_pins p0_reg/CK] [get_pins p1_reg/CK] [get_pins p2_reg/CK] [get_pins p3_reg/CK] [get_pins p4_reg/CK] [get_pins p5_reg/CK] [get_pins p6_reg/CK] [get_pins p7_reg/CK] [get_pins p8_reg/CK] [get_pins csign_reg/CK] [get_pins w_reg_143_/CK] [get_pins w_reg_142_/CK] [get_pins w_reg_141_/CK] [get_pins w_reg_140_/CK] [get_pins w_reg_139_/CK] [get_pins w_reg_138_/CK] [get_pins w_reg_137_/CK] [get_pins w_reg_136_/CK] [get_pins w_reg_135_/CK] [get_pins w_reg_134_/CK] [get_pins w_reg_133_/CK] [get_pins w_reg_132_/CK] [get_pins w_reg_131_/CK] [get_pins w_reg_130_/CK] [get_pins w_reg_129_/CK] [get_pins w_reg_128_/CK] [get_pins w_reg_127_/CK] [get_pins w_reg_126_/CK] [get_pins w_reg_125_/CK] [get_pins w_reg_124_/CK] [get_pins w_reg_123_/CK] [get_pins w_reg_122_/CK] [get_pins w_reg_121_/CK] [get_pins w_reg_120_/CK] [get_pins w_reg_119_/CK] [get_pins w_reg_118_/CK] [get_pins w_reg_117_/CK] [get_pins w_reg_116_/CK] [get_pins w_reg_115_/CK] [get_pins w_reg_114_/CK] [get_pins w_reg_113_/CK] [get_pins w_reg_112_/CK] [get_pins w_reg_111_/CK] [get_pins w_reg_110_/CK] [get_pins w_reg_109_/CK] [get_pins w_reg_108_/CK] [get_pins w_reg_107_/CK] [get_pins w_reg_106_/CK] [get_pins w_reg_105_/CK] [get_pins w_reg_104_/CK] [get_pins w_reg_103_/CK] [get_pins w_reg_102_/CK] [get_pins w_reg_101_/CK] [get_pins w_reg_100_/CK] [get_pins w_reg_99_/CK] [get_pins w_reg_98_/CK] [get_pins w_reg_97_/CK] [get_pins w_reg_96_/CK] [get_pins w_reg_95_/CK] [get_pins w_reg_94_/CK] [get_pins w_reg_93_/CK] [get_pins w_reg_92_/CK] [get_pins w_reg_91_/CK] [get_pins w_reg_90_/CK] [get_pins w_reg_89_/CK] [get_pins w_reg_88_/CK] [get_pins w_reg_87_/CK] [get_pins w_reg_86_/CK] [get_pins w_reg_85_/CK] [get_pins w_reg_84_/CK] [get_pins w_reg_83_/CK] [get_pins w_reg_82_/CK] [get_pins w_reg_81_/CK] [get_pins w_reg_80_/CK] [get_pins w_reg_79_/CK] [get_pins w_reg_78_/CK] [get_pins w_reg_77_/CK] [get_pins w_reg_76_/CK] [get_pins w_reg_75_/CK] [get_pins w_reg_74_/CK] [get_pins w_reg_73_/CK] [get_pins w_reg_72_/CK] [get_pins w_reg_71_/CK] [get_pins w_reg_70_/CK] [get_pins w_reg_69_/CK] [get_pins w_reg_68_/CK] [get_pins w_reg_67_/CK] [get_pins w_reg_66_/CK] [get_pins w_reg_65_/CK] [get_pins w_reg_64_/CK] [get_pins w_reg_63_/CK] [get_pins w_reg_62_/CK] [get_pins w_reg_61_/CK] [get_pins w_reg_60_/CK] [get_pins w_reg_59_/CK] [get_pins w_reg_58_/CK] [get_pins w_reg_57_/CK] [get_pins w_reg_56_/CK] [get_pins w_reg_55_/CK] [get_pins w_reg_54_/CK] [get_pins w_reg_53_/CK] [get_pins w_reg_52_/CK] [get_pins w_reg_51_/CK] [get_pins w_reg_50_/CK] [get_pins w_reg_49_/CK] [get_pins w_reg_48_/CK] [get_pins w_reg_47_/CK] [get_pins w_reg_46_/CK] [get_pins w_reg_45_/CK] [get_pins w_reg_44_/CK] [get_pins w_reg_43_/CK] [get_pins w_reg_42_/CK] [get_pins w_reg_41_/CK] [get_pins w_reg_40_/CK] [get_pins w_reg_39_/CK] [get_pins w_reg_38_/CK] [get_pins w_reg_37_/CK] [get_pins w_reg_36_/CK] [get_pins w_reg_35_/CK] [get_pins w_reg_34_/CK] [get_pins w_reg_33_/CK] [get_pins w_reg_32_/CK] [get_pins w_reg_31_/CK] [get_pins w_reg_30_/CK] [get_pins w_reg_29_/CK] [get_pins w_reg_28_/CK] [get_pins w_reg_27_/CK] [get_pins w_reg_26_/CK] [get_pins w_reg_25_/CK] [get_pins w_reg_24_/CK] [get_pins w_reg_23_/CK] [get_pins w_reg_22_/CK] [get_pins w_reg_21_/CK] [get_pins w_reg_20_/CK] [get_pins w_reg_19_/CK] [get_pins w_reg_18_/CK] [get_pins w_reg_17_/CK] [get_pins w_reg_16_/CK] [get_pins w_reg_15_/CK] [get_pins w_reg_14_/CK] [get_pins w_reg_13_/CK] [get_pins w_reg_12_/CK] [get_pins w_reg_11_/CK] [get_pins w_reg_10_/CK] [get_pins w_reg_9_/CK] [get_pins w_reg_8_/CK] [get_pins w_reg_7_/CK] [get_pins w_reg_6_/CK] [get_pins w_reg_5_/CK] [get_pins w_reg_4_/CK] [get_pins w_reg_3_/CK] [get_pins w_reg_2_/CK] [get_pins w_reg_1_/CK] [get_pins w_reg_0_/CK] [get_pins weight_addr_reg_0_/CK] [get_pins weight_addr_reg_1_/CK] [get_pins weight_addr_reg_2_/CK] [get_pins weight_addr_reg_3_/CK] [get_pins weight_addr_reg_4_/CK] [get_pins weight_addr_reg_5_/CK] [get_pins weight_addr_reg_6_/CK] [get_pins weight_addr_reg_7_/CK] [get_pins weight_addr_reg_8_/CK] [get_pins weight_addr_reg_9_/CK] [get_pins weight_addr_reg_10_/CK] [get_pins ivalid_ff_2_reg/CK] [get_pins ivalid_ff_3_reg/CK] [get_pins ivalid_ff_4_reg/CK] [get_pins ivalid_ff_0_reg/CK] [get_pins ivalid_ff_1_reg/CK] [get_pins cnt_w_reg_0_/CK] [get_pins cnt_w_reg_1_/CK] [get_pins cnt_w_reg_2_/CK] [get_pins cnt_w_reg_3_/CK] [get_pins cnt_w_reg_4_/CK] [get_pins cnt_w_reg_5_/CK] [get_pins cnt_w_reg_6_/CK] [get_pins cnt_w_reg_7_/CK] [get_pins cnt_w_reg_8_/CK] [get_pins cnt_fc_reg_0_/CK] [get_pins cnt_fc_reg_1_/CK] [get_pins cnt_fc_reg_2_/CK] [get_pins cnt_fc_reg_3_/CK] [get_pins cnt_fc_reg_4_/CK] [get_pins cnt_fc_reg_5_/CK] [get_pins cnt_fc_reg_6_/CK] [get_pins cnt_fc_reg_7_/CK] [get_pins cnt_fc_reg_8_/CK]]  -to [list [get_pins osign_reg/D] [get_pins dout_r_reg_1_/D] [get_pins dout_r_reg_2_/D] [get_pins dout_r_reg_3_/D] [get_pins dout_r_reg_4_/D] [get_pins dout_r_reg_5_/D] [get_pins dout_r_reg_6_/D] [get_pins dout_r_reg_7_/D] [get_pins dout_r_reg_8_/D] [get_pins dout_r_reg_9_/D] [get_pins dout_r_reg_10_/D] [get_pins dout_r_reg_11_/D] [get_pins dout_r_reg_12_/D] [get_pins dout_r_reg_13_/D] [get_pins dout_r_reg_14_/D] [get_pins dout_r_reg_15_/D] [get_pins sum_reg_1_/D] [get_pins sum_reg_2_/D] [get_pins sum_reg_3_/D] [get_pins sum_reg_4_/D] [get_pins sum_reg_5_/D] [get_pins sum_reg_6_/D] [get_pins sum_reg_7_/D] [get_pins sum_reg_8_/D] [get_pins sum21_reg_1_/D] [get_pins sum21_reg_2_/D] [get_pins sum21_reg_3_/D] [get_pins sum21_reg_4_/D] [get_pins sum21_reg_5_/D] [get_pins sum21_reg_6_/D] [get_pins sum21_reg_7_/D] [get_pins sum20_reg_1_/D] [get_pins sum20_reg_2_/D] [get_pins sum20_reg_3_/D] [get_pins sum20_reg_4_/D] [get_pins sum20_reg_5_/D] [get_pins sum20_reg_6_/D] [get_pins sum20_reg_7_/D] [get_pins sum10_reg_1_/D] [get_pins sum10_reg_2_/D] [get_pins sum10_reg_3_/D] [get_pins sum10_reg_4_/D] [get_pins sum10_reg_5_/D] [get_pins sum10_reg_6_/D] [get_pins sum12_reg_1_/D] [get_pins sum12_reg_2_/D] [get_pins sum12_reg_3_/D] [get_pins sum12_reg_4_/D] [get_pins sum12_reg_5_/D] [get_pins sum12_reg_6_/D] [get_pins sum11_reg_1_/D] [get_pins sum11_reg_2_/D] [get_pins sum11_reg_3_/D] [get_pins sum11_reg_4_/D] [get_pins sum11_reg_5_/D] [get_pins sum11_reg_6_/D] [get_pins sum00_reg_1_/D] [get_pins sum00_reg_2_/D] [get_pins sum00_reg_3_/D] [get_pins sum00_reg_4_/D] [get_pins sum05_reg_1_/D] [get_pins sum05_reg_2_/D] [get_pins sum05_reg_3_/D] [get_pins sum05_reg_4_/D] [get_pins sum02_reg_1_/D] [get_pins sum02_reg_2_/D] [get_pins sum02_reg_3_/D] [get_pins sum02_reg_4_/D] [get_pins sum01_reg_1_/D] [get_pins sum01_reg_2_/D] [get_pins sum01_reg_3_/D] [get_pins sum01_reg_4_/D] [get_pins sum04_reg_1_/D] [get_pins sum04_reg_2_/D] [get_pins sum04_reg_3_/D] [get_pins sum04_reg_4_/D] [get_pins sum03_reg_1_/D] [get_pins sum03_reg_2_/D] [get_pins sum03_reg_3_/D] [get_pins sum03_reg_4_/D] [get_pins p9_reg/D] [get_pins p10_reg/D] [get_pins p11_reg/D] [get_pins p0_reg/D] [get_pins p1_reg/D] [get_pins p2_reg/D] [get_pins p3_reg/D] [get_pins p4_reg/D] [get_pins p5_reg/D] [get_pins p6_reg/D] [get_pins p7_reg/D] [get_pins p8_reg/D] [get_pins csign_reg/D] [get_pins w_reg_143_/D] [get_pins w_reg_142_/D] [get_pins w_reg_141_/D] [get_pins w_reg_140_/D] [get_pins w_reg_139_/D] [get_pins w_reg_138_/D] [get_pins w_reg_137_/D] [get_pins w_reg_136_/D] [get_pins w_reg_135_/D] [get_pins w_reg_134_/D] [get_pins w_reg_133_/D] [get_pins w_reg_132_/D] [get_pins w_reg_131_/D] [get_pins w_reg_130_/D] [get_pins w_reg_129_/D] [get_pins w_reg_128_/D] [get_pins w_reg_127_/D] [get_pins w_reg_126_/D] [get_pins w_reg_125_/D] [get_pins w_reg_124_/D] [get_pins w_reg_123_/D] [get_pins w_reg_122_/D] [get_pins w_reg_121_/D] [get_pins w_reg_120_/D] [get_pins w_reg_119_/D] [get_pins w_reg_118_/D] [get_pins w_reg_117_/D] [get_pins w_reg_116_/D] [get_pins w_reg_115_/D] [get_pins w_reg_114_/D] [get_pins w_reg_113_/D] [get_pins w_reg_112_/D] [get_pins w_reg_111_/D] [get_pins w_reg_110_/D] [get_pins w_reg_109_/D] [get_pins w_reg_108_/D] [get_pins w_reg_107_/D] [get_pins w_reg_106_/D] [get_pins w_reg_105_/D] [get_pins w_reg_104_/D] [get_pins w_reg_103_/D] [get_pins w_reg_102_/D] [get_pins w_reg_101_/D] [get_pins w_reg_100_/D] [get_pins w_reg_99_/D] [get_pins w_reg_98_/D] [get_pins w_reg_97_/D] [get_pins w_reg_96_/D] [get_pins w_reg_95_/D] [get_pins w_reg_94_/D] [get_pins w_reg_93_/D] [get_pins w_reg_92_/D] [get_pins w_reg_91_/D] [get_pins w_reg_90_/D] [get_pins w_reg_89_/D] [get_pins w_reg_88_/D] [get_pins w_reg_87_/D] [get_pins w_reg_86_/D] [get_pins w_reg_85_/D] [get_pins w_reg_84_/D] [get_pins w_reg_83_/D] [get_pins w_reg_82_/D] [get_pins w_reg_81_/D] [get_pins w_reg_80_/D] [get_pins w_reg_79_/D] [get_pins w_reg_78_/D] [get_pins w_reg_77_/D] [get_pins w_reg_76_/D] [get_pins w_reg_75_/D] [get_pins w_reg_74_/D] [get_pins w_reg_73_/D] [get_pins w_reg_72_/D] [get_pins w_reg_71_/D] [get_pins w_reg_70_/D] [get_pins w_reg_69_/D] [get_pins w_reg_68_/D] [get_pins w_reg_67_/D] [get_pins w_reg_66_/D] [get_pins w_reg_65_/D] [get_pins w_reg_64_/D] [get_pins w_reg_63_/D] [get_pins w_reg_62_/D] [get_pins w_reg_61_/D] [get_pins w_reg_60_/D] [get_pins w_reg_59_/D] [get_pins w_reg_58_/D] [get_pins w_reg_57_/D] [get_pins w_reg_56_/D] [get_pins w_reg_55_/D] [get_pins w_reg_54_/D] [get_pins w_reg_53_/D] [get_pins w_reg_52_/D] [get_pins w_reg_51_/D] [get_pins w_reg_50_/D] [get_pins w_reg_49_/D] [get_pins w_reg_48_/D] [get_pins w_reg_47_/D] [get_pins w_reg_46_/D] [get_pins w_reg_45_/D] [get_pins w_reg_44_/D] [get_pins w_reg_43_/D] [get_pins w_reg_42_/D] [get_pins w_reg_41_/D] [get_pins w_reg_40_/D] [get_pins w_reg_39_/D] [get_pins w_reg_38_/D] [get_pins w_reg_37_/D] [get_pins w_reg_36_/D] [get_pins w_reg_35_/D] [get_pins w_reg_34_/D] [get_pins w_reg_33_/D] [get_pins w_reg_32_/D] [get_pins w_reg_31_/D] [get_pins w_reg_30_/D] [get_pins w_reg_29_/D] [get_pins w_reg_28_/D] [get_pins w_reg_27_/D] [get_pins w_reg_26_/D] [get_pins w_reg_25_/D] [get_pins w_reg_24_/D] [get_pins w_reg_23_/D] [get_pins w_reg_22_/D] [get_pins w_reg_21_/D] [get_pins w_reg_20_/D] [get_pins w_reg_19_/D] [get_pins w_reg_18_/D] [get_pins w_reg_17_/D] [get_pins w_reg_16_/D] [get_pins w_reg_15_/D] [get_pins w_reg_14_/D] [get_pins w_reg_13_/D] [get_pins w_reg_12_/D] [get_pins w_reg_11_/D] [get_pins w_reg_10_/D] [get_pins w_reg_9_/D] [get_pins w_reg_8_/D] [get_pins w_reg_7_/D] [get_pins w_reg_6_/D] [get_pins w_reg_5_/D] [get_pins w_reg_4_/D] [get_pins w_reg_3_/D] [get_pins w_reg_2_/D] [get_pins w_reg_1_/D] [get_pins w_reg_0_/D] [get_pins weight_addr_reg_0_/D] [get_pins weight_addr_reg_1_/D] [get_pins weight_addr_reg_2_/D] [get_pins weight_addr_reg_3_/D] [get_pins weight_addr_reg_4_/D] [get_pins weight_addr_reg_5_/D] [get_pins weight_addr_reg_6_/D] [get_pins weight_addr_reg_7_/D] [get_pins weight_addr_reg_8_/D] [get_pins weight_addr_reg_9_/D] [get_pins weight_addr_reg_10_/D] [get_pins ivalid_ff_2_reg/D] [get_pins ivalid_ff_3_reg/D] [get_pins ivalid_ff_4_reg/D] [get_pins ivalid_ff_0_reg/D] [get_pins ivalid_ff_1_reg/D] [get_pins cnt_w_reg_0_/D] [get_pins cnt_w_reg_1_/D] [get_pins cnt_w_reg_2_/D] [get_pins cnt_w_reg_3_/D] [get_pins cnt_w_reg_4_/D] [get_pins cnt_w_reg_5_/D] [get_pins cnt_w_reg_6_/D] [get_pins cnt_w_reg_7_/D] [get_pins cnt_w_reg_8_/D] [get_pins cnt_fc_reg_0_/D] [get_pins cnt_fc_reg_1_/D] [get_pins cnt_fc_reg_2_/D] [get_pins cnt_fc_reg_3_/D] [get_pins cnt_fc_reg_4_/D] [get_pins cnt_fc_reg_5_/D] [get_pins cnt_fc_reg_6_/D] [get_pins cnt_fc_reg_7_/D] [get_pins cnt_fc_reg_8_/D]]
group_path -weight 3  -name in2reg  -from [list [get_ports clk] [get_ports rstn] [get_ports ivalid] [get_ports din_0] [get_ports din_1] [get_ports din_2] [get_ports din_3] [get_ports din_4] [get_ports din_5] [get_ports din_6] [get_ports din_7] [get_ports din_8] [get_ports din_9] [get_ports din_10] [get_ports din_11] [get_ports weight] [get_ports weight_en]]  -to [list [get_pins osign_reg/D] [get_pins dout_r_reg_1_/D] [get_pins dout_r_reg_2_/D] [get_pins dout_r_reg_3_/D] [get_pins dout_r_reg_4_/D] [get_pins dout_r_reg_5_/D] [get_pins dout_r_reg_6_/D] [get_pins dout_r_reg_7_/D] [get_pins dout_r_reg_8_/D] [get_pins dout_r_reg_9_/D] [get_pins dout_r_reg_10_/D] [get_pins dout_r_reg_11_/D] [get_pins dout_r_reg_12_/D] [get_pins dout_r_reg_13_/D] [get_pins dout_r_reg_14_/D] [get_pins dout_r_reg_15_/D] [get_pins sum_reg_1_/D] [get_pins sum_reg_2_/D] [get_pins sum_reg_3_/D] [get_pins sum_reg_4_/D] [get_pins sum_reg_5_/D] [get_pins sum_reg_6_/D] [get_pins sum_reg_7_/D] [get_pins sum_reg_8_/D] [get_pins sum21_reg_1_/D] [get_pins sum21_reg_2_/D] [get_pins sum21_reg_3_/D] [get_pins sum21_reg_4_/D] [get_pins sum21_reg_5_/D] [get_pins sum21_reg_6_/D] [get_pins sum21_reg_7_/D] [get_pins sum20_reg_1_/D] [get_pins sum20_reg_2_/D] [get_pins sum20_reg_3_/D] [get_pins sum20_reg_4_/D] [get_pins sum20_reg_5_/D] [get_pins sum20_reg_6_/D] [get_pins sum20_reg_7_/D] [get_pins sum10_reg_1_/D] [get_pins sum10_reg_2_/D] [get_pins sum10_reg_3_/D] [get_pins sum10_reg_4_/D] [get_pins sum10_reg_5_/D] [get_pins sum10_reg_6_/D] [get_pins sum12_reg_1_/D] [get_pins sum12_reg_2_/D] [get_pins sum12_reg_3_/D] [get_pins sum12_reg_4_/D] [get_pins sum12_reg_5_/D] [get_pins sum12_reg_6_/D] [get_pins sum11_reg_1_/D] [get_pins sum11_reg_2_/D] [get_pins sum11_reg_3_/D] [get_pins sum11_reg_4_/D] [get_pins sum11_reg_5_/D] [get_pins sum11_reg_6_/D] [get_pins sum00_reg_1_/D] [get_pins sum00_reg_2_/D] [get_pins sum00_reg_3_/D] [get_pins sum00_reg_4_/D] [get_pins sum05_reg_1_/D] [get_pins sum05_reg_2_/D] [get_pins sum05_reg_3_/D] [get_pins sum05_reg_4_/D] [get_pins sum02_reg_1_/D] [get_pins sum02_reg_2_/D] [get_pins sum02_reg_3_/D] [get_pins sum02_reg_4_/D] [get_pins sum01_reg_1_/D] [get_pins sum01_reg_2_/D] [get_pins sum01_reg_3_/D] [get_pins sum01_reg_4_/D] [get_pins sum04_reg_1_/D] [get_pins sum04_reg_2_/D] [get_pins sum04_reg_3_/D] [get_pins sum04_reg_4_/D] [get_pins sum03_reg_1_/D] [get_pins sum03_reg_2_/D] [get_pins sum03_reg_3_/D] [get_pins sum03_reg_4_/D] [get_pins p9_reg/D] [get_pins p10_reg/D] [get_pins p11_reg/D] [get_pins p0_reg/D] [get_pins p1_reg/D] [get_pins p2_reg/D] [get_pins p3_reg/D] [get_pins p4_reg/D] [get_pins p5_reg/D] [get_pins p6_reg/D] [get_pins p7_reg/D] [get_pins p8_reg/D] [get_pins csign_reg/D] [get_pins w_reg_143_/D] [get_pins w_reg_142_/D] [get_pins w_reg_141_/D] [get_pins w_reg_140_/D] [get_pins w_reg_139_/D] [get_pins w_reg_138_/D] [get_pins w_reg_137_/D] [get_pins w_reg_136_/D] [get_pins w_reg_135_/D] [get_pins w_reg_134_/D] [get_pins w_reg_133_/D] [get_pins w_reg_132_/D] [get_pins w_reg_131_/D] [get_pins w_reg_130_/D] [get_pins w_reg_129_/D] [get_pins w_reg_128_/D] [get_pins w_reg_127_/D] [get_pins w_reg_126_/D] [get_pins w_reg_125_/D] [get_pins w_reg_124_/D] [get_pins w_reg_123_/D] [get_pins w_reg_122_/D] [get_pins w_reg_121_/D] [get_pins w_reg_120_/D] [get_pins w_reg_119_/D] [get_pins w_reg_118_/D] [get_pins w_reg_117_/D] [get_pins w_reg_116_/D] [get_pins w_reg_115_/D] [get_pins w_reg_114_/D] [get_pins w_reg_113_/D] [get_pins w_reg_112_/D] [get_pins w_reg_111_/D] [get_pins w_reg_110_/D] [get_pins w_reg_109_/D] [get_pins w_reg_108_/D] [get_pins w_reg_107_/D] [get_pins w_reg_106_/D] [get_pins w_reg_105_/D] [get_pins w_reg_104_/D] [get_pins w_reg_103_/D] [get_pins w_reg_102_/D] [get_pins w_reg_101_/D] [get_pins w_reg_100_/D] [get_pins w_reg_99_/D] [get_pins w_reg_98_/D] [get_pins w_reg_97_/D] [get_pins w_reg_96_/D] [get_pins w_reg_95_/D] [get_pins w_reg_94_/D] [get_pins w_reg_93_/D] [get_pins w_reg_92_/D] [get_pins w_reg_91_/D] [get_pins w_reg_90_/D] [get_pins w_reg_89_/D] [get_pins w_reg_88_/D] [get_pins w_reg_87_/D] [get_pins w_reg_86_/D] [get_pins w_reg_85_/D] [get_pins w_reg_84_/D] [get_pins w_reg_83_/D] [get_pins w_reg_82_/D] [get_pins w_reg_81_/D] [get_pins w_reg_80_/D] [get_pins w_reg_79_/D] [get_pins w_reg_78_/D] [get_pins w_reg_77_/D] [get_pins w_reg_76_/D] [get_pins w_reg_75_/D] [get_pins w_reg_74_/D] [get_pins w_reg_73_/D] [get_pins w_reg_72_/D] [get_pins w_reg_71_/D] [get_pins w_reg_70_/D] [get_pins w_reg_69_/D] [get_pins w_reg_68_/D] [get_pins w_reg_67_/D] [get_pins w_reg_66_/D] [get_pins w_reg_65_/D] [get_pins w_reg_64_/D] [get_pins w_reg_63_/D] [get_pins w_reg_62_/D] [get_pins w_reg_61_/D] [get_pins w_reg_60_/D] [get_pins w_reg_59_/D] [get_pins w_reg_58_/D] [get_pins w_reg_57_/D] [get_pins w_reg_56_/D] [get_pins w_reg_55_/D] [get_pins w_reg_54_/D] [get_pins w_reg_53_/D] [get_pins w_reg_52_/D] [get_pins w_reg_51_/D] [get_pins w_reg_50_/D] [get_pins w_reg_49_/D] [get_pins w_reg_48_/D] [get_pins w_reg_47_/D] [get_pins w_reg_46_/D] [get_pins w_reg_45_/D] [get_pins w_reg_44_/D] [get_pins w_reg_43_/D] [get_pins w_reg_42_/D] [get_pins w_reg_41_/D] [get_pins w_reg_40_/D] [get_pins w_reg_39_/D] [get_pins w_reg_38_/D] [get_pins w_reg_37_/D] [get_pins w_reg_36_/D] [get_pins w_reg_35_/D] [get_pins w_reg_34_/D] [get_pins w_reg_33_/D] [get_pins w_reg_32_/D] [get_pins w_reg_31_/D] [get_pins w_reg_30_/D] [get_pins w_reg_29_/D] [get_pins w_reg_28_/D] [get_pins w_reg_27_/D] [get_pins w_reg_26_/D] [get_pins w_reg_25_/D] [get_pins w_reg_24_/D] [get_pins w_reg_23_/D] [get_pins w_reg_22_/D] [get_pins w_reg_21_/D] [get_pins w_reg_20_/D] [get_pins w_reg_19_/D] [get_pins w_reg_18_/D] [get_pins w_reg_17_/D] [get_pins w_reg_16_/D] [get_pins w_reg_15_/D] [get_pins w_reg_14_/D] [get_pins w_reg_13_/D] [get_pins w_reg_12_/D] [get_pins w_reg_11_/D] [get_pins w_reg_10_/D] [get_pins w_reg_9_/D] [get_pins w_reg_8_/D] [get_pins w_reg_7_/D] [get_pins w_reg_6_/D] [get_pins w_reg_5_/D] [get_pins w_reg_4_/D] [get_pins w_reg_3_/D] [get_pins w_reg_2_/D] [get_pins w_reg_1_/D] [get_pins w_reg_0_/D] [get_pins weight_addr_reg_0_/D] [get_pins weight_addr_reg_1_/D] [get_pins weight_addr_reg_2_/D] [get_pins weight_addr_reg_3_/D] [get_pins weight_addr_reg_4_/D] [get_pins weight_addr_reg_5_/D] [get_pins weight_addr_reg_6_/D] [get_pins weight_addr_reg_7_/D] [get_pins weight_addr_reg_8_/D] [get_pins weight_addr_reg_9_/D] [get_pins weight_addr_reg_10_/D] [get_pins ivalid_ff_2_reg/D] [get_pins ivalid_ff_3_reg/D] [get_pins ivalid_ff_4_reg/D] [get_pins ivalid_ff_0_reg/D] [get_pins ivalid_ff_1_reg/D] [get_pins cnt_w_reg_0_/D] [get_pins cnt_w_reg_1_/D] [get_pins cnt_w_reg_2_/D] [get_pins cnt_w_reg_3_/D] [get_pins cnt_w_reg_4_/D] [get_pins cnt_w_reg_5_/D] [get_pins cnt_w_reg_6_/D] [get_pins cnt_w_reg_7_/D] [get_pins cnt_w_reg_8_/D] [get_pins cnt_fc_reg_0_/D] [get_pins cnt_fc_reg_1_/D] [get_pins cnt_fc_reg_2_/D] [get_pins cnt_fc_reg_3_/D] [get_pins cnt_fc_reg_4_/D] [get_pins cnt_fc_reg_5_/D] [get_pins cnt_fc_reg_6_/D] [get_pins cnt_fc_reg_7_/D] [get_pins cnt_fc_reg_8_/D]]
group_path -weight 3  -name reg2out  -from [list [get_pins osign_reg/CK] [get_pins dout_r_reg_1_/CK] [get_pins dout_r_reg_2_/CK] [get_pins dout_r_reg_3_/CK] [get_pins dout_r_reg_4_/CK] [get_pins dout_r_reg_5_/CK] [get_pins dout_r_reg_6_/CK] [get_pins dout_r_reg_7_/CK] [get_pins dout_r_reg_8_/CK] [get_pins dout_r_reg_9_/CK] [get_pins dout_r_reg_10_/CK] [get_pins dout_r_reg_11_/CK] [get_pins dout_r_reg_12_/CK] [get_pins dout_r_reg_13_/CK] [get_pins dout_r_reg_14_/CK] [get_pins dout_r_reg_15_/CK] [get_pins sum_reg_1_/CK] [get_pins sum_reg_2_/CK] [get_pins sum_reg_3_/CK] [get_pins sum_reg_4_/CK] [get_pins sum_reg_5_/CK] [get_pins sum_reg_6_/CK] [get_pins sum_reg_7_/CK] [get_pins sum_reg_8_/CK] [get_pins sum21_reg_1_/CK] [get_pins sum21_reg_2_/CK] [get_pins sum21_reg_3_/CK] [get_pins sum21_reg_4_/CK] [get_pins sum21_reg_5_/CK] [get_pins sum21_reg_6_/CK] [get_pins sum21_reg_7_/CK] [get_pins sum20_reg_1_/CK] [get_pins sum20_reg_2_/CK] [get_pins sum20_reg_3_/CK] [get_pins sum20_reg_4_/CK] [get_pins sum20_reg_5_/CK] [get_pins sum20_reg_6_/CK] [get_pins sum20_reg_7_/CK] [get_pins sum10_reg_1_/CK] [get_pins sum10_reg_2_/CK] [get_pins sum10_reg_3_/CK] [get_pins sum10_reg_4_/CK] [get_pins sum10_reg_5_/CK] [get_pins sum10_reg_6_/CK] [get_pins sum12_reg_1_/CK] [get_pins sum12_reg_2_/CK] [get_pins sum12_reg_3_/CK] [get_pins sum12_reg_4_/CK] [get_pins sum12_reg_5_/CK] [get_pins sum12_reg_6_/CK] [get_pins sum11_reg_1_/CK] [get_pins sum11_reg_2_/CK] [get_pins sum11_reg_3_/CK] [get_pins sum11_reg_4_/CK] [get_pins sum11_reg_5_/CK] [get_pins sum11_reg_6_/CK] [get_pins sum00_reg_1_/CK] [get_pins sum00_reg_2_/CK] [get_pins sum00_reg_3_/CK] [get_pins sum00_reg_4_/CK] [get_pins sum05_reg_1_/CK] [get_pins sum05_reg_2_/CK] [get_pins sum05_reg_3_/CK] [get_pins sum05_reg_4_/CK] [get_pins sum02_reg_1_/CK] [get_pins sum02_reg_2_/CK] [get_pins sum02_reg_3_/CK] [get_pins sum02_reg_4_/CK] [get_pins sum01_reg_1_/CK] [get_pins sum01_reg_2_/CK] [get_pins sum01_reg_3_/CK] [get_pins sum01_reg_4_/CK] [get_pins sum04_reg_1_/CK] [get_pins sum04_reg_2_/CK] [get_pins sum04_reg_3_/CK] [get_pins sum04_reg_4_/CK] [get_pins sum03_reg_1_/CK] [get_pins sum03_reg_2_/CK] [get_pins sum03_reg_3_/CK] [get_pins sum03_reg_4_/CK] [get_pins p9_reg/CK] [get_pins p10_reg/CK] [get_pins p11_reg/CK] [get_pins p0_reg/CK] [get_pins p1_reg/CK] [get_pins p2_reg/CK] [get_pins p3_reg/CK] [get_pins p4_reg/CK] [get_pins p5_reg/CK] [get_pins p6_reg/CK] [get_pins p7_reg/CK] [get_pins p8_reg/CK] [get_pins csign_reg/CK] [get_pins w_reg_143_/CK] [get_pins w_reg_142_/CK] [get_pins w_reg_141_/CK] [get_pins w_reg_140_/CK] [get_pins w_reg_139_/CK] [get_pins w_reg_138_/CK] [get_pins w_reg_137_/CK] [get_pins w_reg_136_/CK] [get_pins w_reg_135_/CK] [get_pins w_reg_134_/CK] [get_pins w_reg_133_/CK] [get_pins w_reg_132_/CK] [get_pins w_reg_131_/CK] [get_pins w_reg_130_/CK] [get_pins w_reg_129_/CK] [get_pins w_reg_128_/CK] [get_pins w_reg_127_/CK] [get_pins w_reg_126_/CK] [get_pins w_reg_125_/CK] [get_pins w_reg_124_/CK] [get_pins w_reg_123_/CK] [get_pins w_reg_122_/CK] [get_pins w_reg_121_/CK] [get_pins w_reg_120_/CK] [get_pins w_reg_119_/CK] [get_pins w_reg_118_/CK] [get_pins w_reg_117_/CK] [get_pins w_reg_116_/CK] [get_pins w_reg_115_/CK] [get_pins w_reg_114_/CK] [get_pins w_reg_113_/CK] [get_pins w_reg_112_/CK] [get_pins w_reg_111_/CK] [get_pins w_reg_110_/CK] [get_pins w_reg_109_/CK] [get_pins w_reg_108_/CK] [get_pins w_reg_107_/CK] [get_pins w_reg_106_/CK] [get_pins w_reg_105_/CK] [get_pins w_reg_104_/CK] [get_pins w_reg_103_/CK] [get_pins w_reg_102_/CK] [get_pins w_reg_101_/CK] [get_pins w_reg_100_/CK] [get_pins w_reg_99_/CK] [get_pins w_reg_98_/CK] [get_pins w_reg_97_/CK] [get_pins w_reg_96_/CK] [get_pins w_reg_95_/CK] [get_pins w_reg_94_/CK] [get_pins w_reg_93_/CK] [get_pins w_reg_92_/CK] [get_pins w_reg_91_/CK] [get_pins w_reg_90_/CK] [get_pins w_reg_89_/CK] [get_pins w_reg_88_/CK] [get_pins w_reg_87_/CK] [get_pins w_reg_86_/CK] [get_pins w_reg_85_/CK] [get_pins w_reg_84_/CK] [get_pins w_reg_83_/CK] [get_pins w_reg_82_/CK] [get_pins w_reg_81_/CK] [get_pins w_reg_80_/CK] [get_pins w_reg_79_/CK] [get_pins w_reg_78_/CK] [get_pins w_reg_77_/CK] [get_pins w_reg_76_/CK] [get_pins w_reg_75_/CK] [get_pins w_reg_74_/CK] [get_pins w_reg_73_/CK] [get_pins w_reg_72_/CK] [get_pins w_reg_71_/CK] [get_pins w_reg_70_/CK] [get_pins w_reg_69_/CK] [get_pins w_reg_68_/CK] [get_pins w_reg_67_/CK] [get_pins w_reg_66_/CK] [get_pins w_reg_65_/CK] [get_pins w_reg_64_/CK] [get_pins w_reg_63_/CK] [get_pins w_reg_62_/CK] [get_pins w_reg_61_/CK] [get_pins w_reg_60_/CK] [get_pins w_reg_59_/CK] [get_pins w_reg_58_/CK] [get_pins w_reg_57_/CK] [get_pins w_reg_56_/CK] [get_pins w_reg_55_/CK] [get_pins w_reg_54_/CK] [get_pins w_reg_53_/CK] [get_pins w_reg_52_/CK] [get_pins w_reg_51_/CK] [get_pins w_reg_50_/CK] [get_pins w_reg_49_/CK] [get_pins w_reg_48_/CK] [get_pins w_reg_47_/CK] [get_pins w_reg_46_/CK] [get_pins w_reg_45_/CK] [get_pins w_reg_44_/CK] [get_pins w_reg_43_/CK] [get_pins w_reg_42_/CK] [get_pins w_reg_41_/CK] [get_pins w_reg_40_/CK] [get_pins w_reg_39_/CK] [get_pins w_reg_38_/CK] [get_pins w_reg_37_/CK] [get_pins w_reg_36_/CK] [get_pins w_reg_35_/CK] [get_pins w_reg_34_/CK] [get_pins w_reg_33_/CK] [get_pins w_reg_32_/CK] [get_pins w_reg_31_/CK] [get_pins w_reg_30_/CK] [get_pins w_reg_29_/CK] [get_pins w_reg_28_/CK] [get_pins w_reg_27_/CK] [get_pins w_reg_26_/CK] [get_pins w_reg_25_/CK] [get_pins w_reg_24_/CK] [get_pins w_reg_23_/CK] [get_pins w_reg_22_/CK] [get_pins w_reg_21_/CK] [get_pins w_reg_20_/CK] [get_pins w_reg_19_/CK] [get_pins w_reg_18_/CK] [get_pins w_reg_17_/CK] [get_pins w_reg_16_/CK] [get_pins w_reg_15_/CK] [get_pins w_reg_14_/CK] [get_pins w_reg_13_/CK] [get_pins w_reg_12_/CK] [get_pins w_reg_11_/CK] [get_pins w_reg_10_/CK] [get_pins w_reg_9_/CK] [get_pins w_reg_8_/CK] [get_pins w_reg_7_/CK] [get_pins w_reg_6_/CK] [get_pins w_reg_5_/CK] [get_pins w_reg_4_/CK] [get_pins w_reg_3_/CK] [get_pins w_reg_2_/CK] [get_pins w_reg_1_/CK] [get_pins w_reg_0_/CK] [get_pins weight_addr_reg_0_/CK] [get_pins weight_addr_reg_1_/CK] [get_pins weight_addr_reg_2_/CK] [get_pins weight_addr_reg_3_/CK] [get_pins weight_addr_reg_4_/CK] [get_pins weight_addr_reg_5_/CK] [get_pins weight_addr_reg_6_/CK] [get_pins weight_addr_reg_7_/CK] [get_pins weight_addr_reg_8_/CK] [get_pins weight_addr_reg_9_/CK] [get_pins weight_addr_reg_10_/CK] [get_pins ivalid_ff_2_reg/CK] [get_pins ivalid_ff_3_reg/CK] [get_pins ivalid_ff_4_reg/CK] [get_pins ivalid_ff_0_reg/CK] [get_pins ivalid_ff_1_reg/CK] [get_pins cnt_w_reg_0_/CK] [get_pins cnt_w_reg_1_/CK] [get_pins cnt_w_reg_2_/CK] [get_pins cnt_w_reg_3_/CK] [get_pins cnt_w_reg_4_/CK] [get_pins cnt_w_reg_5_/CK] [get_pins cnt_w_reg_6_/CK] [get_pins cnt_w_reg_7_/CK] [get_pins cnt_w_reg_8_/CK] [get_pins cnt_fc_reg_0_/CK] [get_pins cnt_fc_reg_1_/CK] [get_pins cnt_fc_reg_2_/CK] [get_pins cnt_fc_reg_3_/CK] [get_pins cnt_fc_reg_4_/CK] [get_pins cnt_fc_reg_5_/CK] [get_pins cnt_fc_reg_6_/CK] [get_pins cnt_fc_reg_7_/CK] [get_pins cnt_fc_reg_8_/CK]]  -to [list [get_ports ovalid] [get_ports {dout[15]}] [get_ports {dout[14]}] [get_ports {dout[13]}] [get_ports {dout[12]}] [get_ports {dout[11]}] [get_ports {dout[10]}] [get_ports {dout[9]}] [get_ports {dout[8]}] [get_ports {dout[7]}] [get_ports {dout[6]}] [get_ports {dout[5]}] [get_ports {dout[4]}] [get_ports {dout[3]}] [get_ports {dout[2]}] [get_ports {dout[1]}] [get_ports {dout[0]}]]
group_path -weight 2  -name in2out  -from [list [get_ports clk] [get_ports rstn] [get_ports ivalid] [get_ports din_0] [get_ports din_1] [get_ports din_2] [get_ports din_3] [get_ports din_4] [get_ports din_5] [get_ports din_6] [get_ports din_7] [get_ports din_8] [get_ports din_9] [get_ports din_10] [get_ports din_11] [get_ports weight] [get_ports weight_en]]  -to [list [get_ports ovalid] [get_ports {dout[15]}] [get_ports {dout[14]}] [get_ports {dout[13]}] [get_ports {dout[12]}] [get_ports {dout[11]}] [get_ports {dout[10]}] [get_ports {dout[9]}] [get_ports {dout[8]}] [get_ports {dout[7]}] [get_ports {dout[6]}] [get_ports {dout[5]}] [get_ports {dout[4]}] [get_ports {dout[3]}] [get_ports {dout[2]}] [get_ports {dout[1]}] [get_ports {dout[0]}]]
group_path -name **clock_gating_default**
set_input_transition -max 1  [get_ports clk]
set_input_transition -min 1  [get_ports clk]
set_input_transition -max 1  [get_ports rstn]
set_input_transition -min 1  [get_ports rstn]
set_input_transition -max 1  [get_ports ivalid]
set_input_transition -min 1  [get_ports ivalid]
set_input_transition -max 1  [get_ports din_0]
set_input_transition -min 1  [get_ports din_0]
set_input_transition -max 1  [get_ports din_1]
set_input_transition -min 1  [get_ports din_1]
set_input_transition -max 1  [get_ports din_2]
set_input_transition -min 1  [get_ports din_2]
set_input_transition -max 1  [get_ports din_3]
set_input_transition -min 1  [get_ports din_3]
set_input_transition -max 1  [get_ports din_4]
set_input_transition -min 1  [get_ports din_4]
set_input_transition -max 1  [get_ports din_5]
set_input_transition -min 1  [get_ports din_5]
set_input_transition -max 1  [get_ports din_6]
set_input_transition -min 1  [get_ports din_6]
set_input_transition -max 1  [get_ports din_7]
set_input_transition -min 1  [get_ports din_7]
set_input_transition -max 1  [get_ports din_8]
set_input_transition -min 1  [get_ports din_8]
set_input_transition -max 1  [get_ports din_9]
set_input_transition -min 1  [get_ports din_9]
set_input_transition -max 1  [get_ports din_10]
set_input_transition -min 1  [get_ports din_10]
set_input_transition -max 1  [get_ports din_11]
set_input_transition -min 1  [get_ports din_11]
set_input_transition -max 1  [get_ports weight]
set_input_transition -min 1  [get_ports weight]
set_input_transition -max 1  [get_ports weight_en]
set_input_transition -min 1  [get_ports weight_en]
set_timing_derate -late -data -net_delay 1.05 
set_timing_derate -late -data -cell_delay 1.05 
